Archive/sysbench-runs/series15/res01/sysbench.ro.32.res
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 32
Report intermediate results every 5 second(s)
Initializing random number generator from seed (42).


Threads started!

[   5s] threads: 32, tps: 4666.56, reads/s: 65383.08, writes/s: 0.00, response time: 11.15ms (99%)
[  10s] threads: 32, tps: 4732.61, reads/s: 66251.71, writes/s: 0.00, response time: 10.46ms (99%)
[  15s] threads: 32, tps: 4741.00, reads/s: 66384.60, writes/s: 0.00, response time: 10.46ms (99%)
[  20s] threads: 32, tps: 4742.80, reads/s: 66388.27, writes/s: 0.00, response time: 10.56ms (99%)
[  25s] threads: 32, tps: 4740.00, reads/s: 66358.62, writes/s: 0.00, response time: 10.43ms (99%)
[  30s] threads: 32, tps: 4743.60, reads/s: 66426.17, writes/s: 0.00, response time: 10.50ms (99%)
[  35s] threads: 32, tps: 4743.40, reads/s: 66395.22, writes/s: 0.00, response time: 10.41ms (99%)
[  40s] threads: 32, tps: 4743.39, reads/s: 66415.07, writes/s: 0.00, response time: 10.53ms (99%)
[  45s] threads: 32, tps: 4749.60, reads/s: 66494.64, writes/s: 0.00, response time: 10.46ms (99%)
[  50s] threads: 32, tps: 4745.80, reads/s: 66437.21, writes/s: 0.00, response time: 10.63ms (99%)
[  55s] threads: 32, tps: 4745.20, reads/s: 66433.56, writes/s: 0.00, response time: 10.44ms (99%)
[  60s] threads: 32, tps: 4751.00, reads/s: 66512.00, writes/s: 0.00, response time: 10.51ms (99%)
[  65s] threads: 32, tps: 4746.60, reads/s: 66449.79, writes/s: 0.00, response time: 10.53ms (99%)
[  70s] threads: 32, tps: 4744.00, reads/s: 66412.99, writes/s: 0.00, response time: 10.53ms (99%)
[  75s] threads: 32, tps: 4746.01, reads/s: 66441.95, writes/s: 0.00, response time: 10.46ms (99%)
[  80s] threads: 32, tps: 4739.80, reads/s: 66364.40, writes/s: 0.00, response time: 10.44ms (99%)
[  85s] threads: 32, tps: 4737.59, reads/s: 66326.10, writes/s: 0.00, response time: 10.57ms (99%)
[  90s] threads: 32, tps: 4734.40, reads/s: 66283.63, writes/s: 0.00, response time: 10.45ms (99%)
[  95s] threads: 32, tps: 4739.80, reads/s: 66350.17, writes/s: 0.00, response time: 10.65ms (99%)
[ 100s] threads: 32, tps: 4740.00, reads/s: 66372.62, writes/s: 0.00, response time: 10.62ms (99%)
[ 105s] threads: 32, tps: 4738.60, reads/s: 66332.05, writes/s: 0.00, response time: 10.44ms (99%)
[ 110s] threads: 32, tps: 4735.80, reads/s: 66302.78, writes/s: 0.00, response time: 10.56ms (99%)
[ 115s] threads: 32, tps: 4748.97, reads/s: 66478.82, writes/s: 0.00, response time: 10.39ms (99%)
[ 120s] threads: 32, tps: 4752.22, reads/s: 66534.06, writes/s: 0.00, response time: 10.47ms (99%)
[ 125s] threads: 32, tps: 4738.61, reads/s: 66340.55, writes/s: 0.00, response time: 10.51ms (99%)
[ 130s] threads: 32, tps: 4742.40, reads/s: 66401.38, writes/s: 0.00, response time: 10.47ms (99%)
[ 135s] threads: 32, tps: 4746.81, reads/s: 66441.28, writes/s: 0.00, response time: 10.59ms (99%)
[ 140s] threads: 32, tps: 4745.79, reads/s: 66453.41, writes/s: 0.00, response time: 10.61ms (99%)
[ 145s] threads: 32, tps: 4742.20, reads/s: 66391.44, writes/s: 0.00, response time: 10.50ms (99%)
[ 150s] threads: 32, tps: 4739.41, reads/s: 66362.70, writes/s: 0.00, response time: 10.62ms (99%)
[ 155s] threads: 32, tps: 4742.18, reads/s: 66380.78, writes/s: 0.00, response time: 10.54ms (99%)
[ 160s] threads: 32, tps: 4745.22, reads/s: 66436.01, writes/s: 0.00, response time: 10.56ms (99%)
[ 165s] threads: 32, tps: 4742.80, reads/s: 66386.94, writes/s: 0.00, response time: 10.51ms (99%)
[ 170s] threads: 32, tps: 4746.42, reads/s: 66458.82, writes/s: 0.00, response time: 10.45ms (99%)
[ 175s] threads: 32, tps: 4748.99, reads/s: 66487.02, writes/s: 0.00, response time: 10.57ms (99%)
[ 180s] threads: 32, tps: 4742.19, reads/s: 66381.50, writes/s: 0.00, response time: 10.58ms (99%)
[ 185s] threads: 32, tps: 4745.01, reads/s: 66420.34, writes/s: 0.00, response time: 10.51ms (99%)
[ 190s] threads: 32, tps: 4739.40, reads/s: 66374.59, writes/s: 0.00, response time: 10.65ms (99%)
[ 195s] threads: 32, tps: 4740.80, reads/s: 66366.59, writes/s: 0.00, response time: 10.50ms (99%)
[ 200s] threads: 32, tps: 4743.99, reads/s: 66413.69, writes/s: 0.00, response time: 10.49ms (99%)
[ 205s] threads: 32, tps: 4743.60, reads/s: 66409.59, writes/s: 0.00, response time: 10.54ms (99%)
[ 210s] threads: 32, tps: 4746.60, reads/s: 66448.00, writes/s: 0.00, response time: 10.48ms (99%)
[ 215s] threads: 32, tps: 4741.00, reads/s: 66383.86, writes/s: 0.00, response time: 10.48ms (99%)
[ 220s] threads: 32, tps: 4738.19, reads/s: 66325.33, writes/s: 0.00, response time: 10.57ms (99%)
[ 225s] threads: 32, tps: 4740.20, reads/s: 66364.66, writes/s: 0.00, response time: 10.50ms (99%)
[ 230s] threads: 32, tps: 4745.61, reads/s: 66437.88, writes/s: 0.00, response time: 10.45ms (99%)
[ 235s] threads: 32, tps: 4740.39, reads/s: 66370.73, writes/s: 0.00, response time: 10.60ms (99%)
[ 240s] threads: 32, tps: 4744.59, reads/s: 66421.12, writes/s: 0.00, response time: 10.47ms (99%)
[ 245s] threads: 32, tps: 4762.20, reads/s: 66677.41, writes/s: 0.00, response time: 10.42ms (99%)
[ 250s] threads: 32, tps: 4757.00, reads/s: 66591.63, writes/s: 0.00, response time: 10.54ms (99%)
[ 255s] threads: 32, tps: 4766.20, reads/s: 66719.83, writes/s: 0.00, response time: 10.44ms (99%)
[ 260s] threads: 32, tps: 4763.60, reads/s: 66698.86, writes/s: 0.00, response time: 10.46ms (99%)
[ 265s] threads: 32, tps: 4760.20, reads/s: 66650.16, writes/s: 0.00, response time: 10.41ms (99%)
[ 270s] threads: 32, tps: 4756.99, reads/s: 66593.29, writes/s: 0.00, response time: 10.37ms (99%)
[ 275s] threads: 32, tps: 4753.61, reads/s: 66543.93, writes/s: 0.00, response time: 10.41ms (99%)
[ 280s] threads: 32, tps: 4757.60, reads/s: 66609.44, writes/s: 0.00, response time: 10.43ms (99%)
[ 285s] threads: 32, tps: 4763.80, reads/s: 66693.96, writes/s: 0.00, response time: 10.47ms (99%)
[ 290s] threads: 32, tps: 4759.60, reads/s: 66641.05, writes/s: 0.00, response time: 10.59ms (99%)
[ 295s] threads: 32, tps: 4758.99, reads/s: 66622.90, writes/s: 0.00, response time: 10.45ms (99%)
[ 300s] threads: 32, tps: 4765.20, reads/s: 66702.80, writes/s: 0.00, response time: 10.37ms (99%)
OLTP test statistics:
    queries performed:
        read:                            20062784
        write:                           0
        other:                           2866112
        total:                           22928896
    transactions:                        1433056 (4745.14 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 20062784 (66432.03 per sec.)
    other operations:                    2866112 (9490.29 per sec.)

General statistics:
    total time:                          302.0047s
    total number of events:              1433056
    total time taken by event execution: 9660.5093s
    response time:
         min:                                  2.34ms
         avg:                                  6.74ms
         max:                                 40.94ms
         approx.  99 percentile:              10.52ms

Threads fairness:
    events (avg/stddev):           44783.0000/74.57
    execution time (avg/stddev):   301.8909/0.00